#    -*- mode: org -*-


Archived entries from file /home/erker/projects/snag/snag.org


* extract values at training polygons
  :PROPERTIES:
  :ARCHIVE_TIME: 2018-06-07 Thu 13:37
  :ARCHIVE_FILE: ~/projects/snag/snag.org
  :ARCHIVE_CATEGORY: snag
  :END:

#+begin_src R
train.stack.int <- stack(list.files("data/image/train/int", full.names = T, pattern = ".*.tif$"))
#+end_src

#+RESULTS:

#+begin_src R

  mat <- ff(vmode="integer",dim=c(ncell(train.stack),nlayers(train.stack)),filename="data/image/train/trainstack.ffdata")

  for(i in 1:nlayers(train.stack.int)){
      mat[,i] <- train.stack.int[[i]][]
  }

  save(mat,file="data/image/train/train_stack_mat.RData")

  ID_Raster <- raster(train.stack.int[[1]])
  ID_Raster[] <- 1:ncell(train.stack.int[[1]])
#+end_src

#+RESULTS:

#+begin_src R
  ext_ID <- extract(ID_Raster, s, df = T)
  s@data$ID <- 1:length(s)
  ext_ID <- left_join(ext_ID, s@data)

  extracted.values <- mat[as.numeric(ext_ID$layer),]

  df <- data.frame(extracted.values)
  colnames(df) <- paste0("X",str_match(names(train.stack), "train(.*)")[,2])

  df$Class <- factor(ext_ID$Class)
#+end_src

#+RESULTS:
: Joining, by = "ID"

#+begin_src R
saveRDS(df, "data/training/model_building_df.rds")
#+end_src

#+RESULTS:


Archived entries from file /home/erker/projects/snag/snag.org


